# StairsAutomaticLandingLayoutWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsAutomaticLandingLayoutWarn Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Fail to generate the automatic landing layout
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsAutomaticLandingLayoutWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAutomaticLandingLayoutWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsAutomaticLandingLayoutWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace